{
  "posts": [
    {
      "id": "ebbe",
      "title": "Ballon d'Or 2024 official rankings",
      "content": "As the midfielder was rewarded for his sensational 2023-24 campaign, the rest of the 30-man shortlist found out their final positions in the voting\n\nThe Ballon d'Or. Love it or loathe it, it's the award every footballer in the world dreams of one day winning. And now, after a memorable 2023-24 campaign, the winner of the 2024 Golden Ball has been announced: Rodri.\n\nThe Manchester City and Spain midfielder has emerged as the finest No.6 in world football over the past couple of seasons, and he was key to City winning a record-breaking, fourth-successive Premier League title before he then won Player of the Tournament at Euro 2024 as La Roja triumphed in Germany.\n\nAs well as his ability to shield the defence and maintain possession in the middle of the park, Rodri has taken his game to a new level by providing more in attack. He returned 12 goals and 15 assists for club and country over the course of the season, while he only finished on the losing side once inside 90 minutes, that coming when City were beaten in the FA Cup final.\n\nThe 28-year-old faced tough competition for his first Ballon d'Or as he beat off competition from Real Madrid duo Vinicius Jr and Jude Bellingham, who finished second and third, respectively, after playing key roles in Los Blancos winning both La Liga and the Champions League.\n\nThat trio were up at the very top of the rankings for 2024, but how did the rest of the 30-man shortlist shake out when all the votes were counted? Check out the official rankings below:",
      "author": "Nima",
      "tags": [
        "football"
      ],
      "date": "2024-10-30"
    },
    {
      "id": "3eac",
      "title": "Liverpool want £50m Premier League forward who has been in brilliant form this season",
      "content": "Liverpool have been one of the hardest clubs to decipher in the transfer market as they usually tend to keep their cards close to their chest.\n\nThere wasn’t a peep about Federico Chiesa until the deal was at an advanced stage to bring him to Anfield, although the agreement in principle to sign Giorgi Mamardashvili hit the mainstream media as it involved drawn-out negotiations.\n\nThe Reds refrained from splashing the cash in the summer but that is unlikely to be the case in the upcoming windows.\n\nAnd if reports are to be believed, Liverpool are keeping a close eye on one of the most in-form players in the Premier League.\n\nBryan Mbeumo attracting attention from Liverpool\nMarvin Johnson of Sheffield Wednesday runs with the ball whilst under pressure from Bryan Mbeumo of Brentford during the Carabao Cup Fourth Round m...\nPhoto by Alex Pantling/Getty Images\nBryan Mbeumo was linked with a move to Liverpool in the summer after scoring nine Premier League goals last season, but a transfer never came to fruition.\n\nThe Frenchman has continued in his merry ways this time around and has already scored eight Premier League goals, with only Erling Haaland (11) above him in the race for the Golden Boot.\n\nHis exploits have spearheaded Brentford to ninth in the Premier League table, which is a fantastic position for them at this stage of the season.",
      "author": "Nima",
      "tags": [
        "football"
      ],
      "date": "2024-10-30"
    },
    {
      "id": "82c3",
      "title": "The top 100 PC games",
      "content": "23. Sekiro: Shadows Die Twice\nReleased Mar 21, 2019 | Top 100 Score 237.87\n\n#23, Sekiro\n\n(Image credit: Activision)\nWes Fenlon: Shadows Die Twice is full of beautiful dualities. Patient stealth is followed by arterial blood spraying executions. It demands true mastery of the sword and parry timings, yet also allows you to cheese bosses with an umbrella. At one point you fight a giant ape, and then—get this—another ape shows up. My actual favorite FromSoft game.\n\nHarvey Randall: Shadows Die Twice is such a focused game. In your typical soulslike, FromSoftware has to account for a glut of builds—but not so here. The studio knows what tools you have, and with that knowledge is able to craft some all-timer boss fights that have barely seen competition since.\n\nJoshua Wolens: The coolest I've ever felt playing a FromSoft game, but why do we keep calling it Shadows Die Twice?\n\nTed Litchfield: If you're anything like me, the Shadow will die many more times than that in a given playthrough.\n\n22. Hollow Knight\nReleased Feb 24, 2017 | Top 100 Score 238.06\n\n#22, Hollow Knight\n\n(Image credit: Team Cherry)\nKara Phillips: I didn't think much of metroidvanias before going into Hollow Knight, but I quickly found a home in Hallownest. It's one of the only games to drive me to pure fury during a boss fight, but it still had me coming back to try again. Plus, it's got an incredible soundtrack that never loses its charm no matter how many times you listen to it, which you'll have to do an awful lot if you're like me and constantly die to the same boss over and over again. Seriously. The mantis lords nearly brought me to tears.\n\nHarvey Randall: Proof that a game can have a lot of bugs in it and still be really good.\n\n21. Alan Wake 2\nReleased Oct 27, 2023 | Top 100 Score 238.87\n\n#21, Alan Wake 2\n\n(Image credit: Epic Games)\nElie Gould: I spent the first few hours of Alan Wake 2 screaming at my monitor every time one of the godforsaken psychic visions popped up out of nowhere to scare me out of my skin. But once the initial shock wore off I was able to enjoy Alan Wake 2 like no other horror game I've come across. The locations, characters, and fantastic story made every awful chase scene or psychedelic trip in the dark place more than worth it—I loved every moment I spent with Saga Anderson. I'd do it all again just to see all the mind-bending cutscenes.\n\nRobin Valentine: The game's storytelling is so wonderfully layered and creative, combining traditional cutscenes with every other medium Remedy could get its hands on. I voluntarily stayed in a movie theater in this game to watch a full live action short horror film entirely in Finnish and loved every minute of it. Now that's unique.\n\n#20-11\n20. Hades\nReleased Sep 20, 2020 | Top 100 Score 240.27\n\n#20, Hades\n\n(Image credit: Supergiant Games)\nJody Macgregor: Hades is the premiere roguelike for people who don't normally enjoy roguelikes. I'm aware saying that will summon the fun police to tell me that since it contains persistent progression elements it's technically a roguelite, but if you come for me I'll just be reborn in my pool of blood and then spend several minutes arguing with my dad and flirting with Thanatos before I return to the underworld to flirt with death in a less literal way.\n\nHarvey Randall: It's hard to overstate just how much of an impact Hades has had on the roguelike genre—not only is it some of Supergiant's finest work, it also proved that you can tell a strong narrative in a game that ends every time you die.\n\nHades' cast of characters are remarkably well-characterised, each managing to sustain their own little arcs. It's a game as much about reconciling family traumas as it is, well, hitting stuff with cool weapons. To even spin a functional yarn within the roguelike framework, it's another thing to put together a tale that's so engaging. The best thing? Hades is more than this novelty.\n\nIt's rare that I look at a game and have pretty much zero complaints, but Hades is one of those games. It's a really tightly-designed romp, with interlocking systems that play nicely together. Categorising boons by their prospective god helps you to learn and remember what combinations are available, and controlling Zagreus feels like silk. The thing's gorgeous—everybody knows that—and Darren Korb has some of the best musical chops in the industry bar none.\n\nElie Gould: I ended up getting Hades just because I wanted some context before I played the sequel, but after getting absolutely hooked I didn't end up making it to Hades 2, and I'm not mad. Exploring the various regions of the underworld was great fun, and while I didn't master every weapon on offer I'm still proud of myself for getting to the end on a couple of occasions, and keeping some of my sanity while I did it. I also became surprisingly invested in all the characters that I encountered along the way. I have bad habits when it comes to roguelikes where I ignore everything other than the objective right in front of me and try to complete said task as quickly as possible. But I'm very thankful that I managed to slow things down and actually appreciate my time in this game. I devoted countless hours and all three of my brain cells to completing this game, I can safely say that all the pain was worth it.\n\n19. Slay the Spire\nReleased Jan 23, 2019 | Top 100 Score 240.29\n\n#19, Slay the Spire\n\n(Image credit: Mega Crit)\nHarvey Randall: I have 276 hours logged in Slay the Spire. I regret none of them. It does what a good roguelike should do, in that its network of relics and cards serve the wider goal of controlled chaos—chaos that, if you can wrangle it, turns you into a demigod in short order.\n\nBut like I mention with Hades above, and like Robin mentions below, Slay the Spire feels foundational to its genre. It's a blueprint for the deluge of roguelike deck builders that came after it—some of which I think are quite good—but it's absolutely the OG. There's something about building out a deck of cards and the structure of a permadeath RPG that go together like butter and toast.\n\nMaybe because it gives the developer permission to go hog wild with synergies. If you play a TCG like Hearthstone, god-tier combos are a cause for the wringing of hands and a call for balance changes. But because access to them is gated from you by the roguelike mechanics in Slay the Spire, not only can they exist—they can be the meat and potatoes of the entire thing. It's really very good.\n\nRobin Valentine: These days I try pretty much every roguelike deckbuilder going, and I gotta say, there's still very few that beat this foundational game. Only Balatro has felt as fresh—more on that further down the list.\n\nJake Tucker: Many deckbuilding pretenders followed in Slay The Spire’s wake, but none of them have managed to hold a torch to the original. I still play several hours of Slay The Spire each month, as the well designed combat and flexible cards mean every run feels like you’re surviving on a knife edge. I’m not sure anything barring the upcoming sequel will be able to break the hold Slay The Spire has on me.\n\n18. Mass Effect Legendary Edition\nReleased May 14, 2021 | Top 100 Score 240.61\n\n#18, Mass Effect\n\n(Image credit: EA)\nJody Macgregor: When Mass Effect came out it confused people because they thought it was a shooter with too much talking, rather than seeing it as an RPG with a combat system that doesn't suck. That's how rare it was to have even competent, not amazing, basically fine combat in an RPG at the time.\n\nTo be fair, it was also rare to have an RPG that felt this much like watching a TV show rather than reading a book. Mass Effect is your favourite sci-fi show: the game, and the Legendary Edition is a DVD box set that packages all three seasons together with a bunch of sweet bonus features.\n\nTed Litchfield: I don't care if the Reapers are destroying the galaxy or that, when you really think about it, Commander Shepard is the most cuddly fascist fantasy liberal Canada had to offer us in the late Bush years⁠—I still sometimes wish I lived on the Citadel. The AI mass culling and reporter-punching psychos (she was asking good questions!!!) may be driving down property values, but there ain't no place like it, baby.\n\nAlso, I've said it before and I'll say it again: Mass Effect 1's Uncharted Worlds whip ass, the Mako was always good, and Mass Effect 3⁠—the whole thing, not just the ending⁠—is by far the weakest part of the trilogy.\n\nJody Macgregor: Don't listen to Ted. The Uncharted Worlds drool and Tuchanka rules.\n\nSean Martin: I've played through all Mass Effect games three times now and there really is no RPG experience quite like it. The best of those was definitely with the Legendary edition—it actually makes the first game feel playable again despite its age.\n\nJoshua Wolens: The weird thing about Mass Effect is that it executed incredibly well on a specific flavour of sci-fi in its first game and then spent the next two desperately groping to become something wildly different. It went from an eerie, exploratory, eldritch sci-fi adventure to a rootin'-tootin' action film starring Commander 'Space Christ' Shepard and their gang of pals. I like both types plenty—and I've warmed considerably on ME3 after really disliking it my first time through—but I can't help but wonder what we would've got if the whole series had been more confident in its identity from the jump.\n\n17. Rimworld\nReleased Oct 17, 2018 | Top 100 Score 241.36\n\n#17, RimWorld\n\n(Image credit: Ludeon Studios)\nNatanael Albuquerque: If you're into min-max automation games, you'll love simulating an oversized money printer with turrets guarding against super soldiers. And for those of us who prefer life simulation and crafting unique stories, watching your colony implode within six hours of your fridge breaking down is a special kind of thrill.\n\nEvan Lahti: Sometimes I get annoyed with armchair comments from gamers that casually throw out absurd, unrealistic requests like \"This game would be good if they just added co-op.\" But incredibly, Rimworld, in its obscene moddability, produced a mod that adds co-op, and it mostly works.\n\nA domestic life sim with intermittent mechanoid centipede attacks. You'll be fighting a pack of raiders, and a stray bullet will float into your animal pen, injuring your pet turkey Mr. Gravy in its left foot, a modular and non-abstracted part of the turkey anatomy that Rimworld tracks, in its obscene granularity. Then you will rush the turkey to your sickbay and administer actual medicine from a frontier doctor you've tirelessly trained to save lives, all while the raider attack plays out in the background. An alien ant farm that embodies the tradition of weirdness native to PC gaming.",
      "author": "PCgamer",
      "tags": [
        "games"
      ],
      "date": "2024-10-30"
    },
    {
      "id": "61e4",
      "title": "Best Crime Thriller Movies",
      "content": "Crime thriller movies captivate audiences with their suspenseful plots and intense character dynamics. Some of the best crime thrillers include \"The Dark Knight\" (2008), directed by Christopher Nolan, which features Heath Ledger's iconic performance as the Joker. Another standout is \"Shutter Island\" (2010), directed by Martin Scorsese, starring Leonardo DiCaprio as a U.S. Marshal investigating the disappearance of a patient from an island asylum. \"Gone Girl\" (2014), directed by David Fincher, is also a must-watch, with its gripping storyline and unexpected twists. These films are known for their masterful storytelling, complex characters, and thrilling narratives that keep viewers on the edge of their seats",
      "author": "Imdb",
      "tags": [
        "movies"
      ],
      "date": "2024-10-30T20:38:24.089Z"
    },
    {
      "id": "06cd",
      "title": "Best PC Games",
      "content": "The world of PC gaming is vast and diverse, offering something for every type of gamer. Some of the best PC games to play right now include \"Elden Ring\", an action RPG with an expansive open world and deep lore. \"The Witcher 3: Wild Hunt\" is another highly acclaimed game, known for its rich storytelling and immersive gameplay. For strategy enthusiasts, \"XCOM 2\" offers intense tactical combat and a gripping campaign. \"Hollow Knight: The Final Cut\" is perfect for those who enjoy challenging metroidvania games, while \"Forza Horizon 5\" provides an exhilarating racing experience with stunning visuals. These games showcase the best of what PC gaming has to offer, from epic adventures to strategic challenges.",
      "author": "PC gamer",
      "tags": [
        "games"
      ],
      "date": "2024-10-30T20:39:22.307Z"
    },
    {
      "id": "0589",
      "title": "Best Series to Watch ",
      "content": "When it comes to binge-worthy TV series, there are plenty of options to choose from. \"Stranger Things\" is a sci-fi thriller that has captured the hearts of viewers with its nostalgic 80s references and compelling storyline. \"Breaking Bad\" is a modern classic, following the transformation of a high school chemistry teacher into a drug kingpin. \"Game of Thrones\" offers a sprawling epic with complex characters and political intrigue. For those who enjoy crime dramas, \"Mindhunter\" is a fascinating look into the minds of serial killers. These series are known for their high production values, engaging plots, and memorable performances.",
      "author": "Nima",
      "tags": [
        "series"
      ],
      "date": "2024-10-30T20:40:00.845Z"
    },
    {
      "id": "275a",
      "title": "Top 10 Anime of This Decade",
      "content": "1. Attack on Titan (2013-2023): This intense series follows Eren Jaeger and his friends as they fight against giant humanoid Titans threatening humanity's existence. Its gripping storyline and stunning animation have made it a fan favorite1.\n\n2. Demon Slayer: Kimetsu no Yaiba (2019-): Tanjiro Kamado's quest to avenge his family and cure his sister Nezuko from demon possession has captivated audiences with its beautiful animation and heartwarming story.\n\n3. My Hero Academia (2016-): Set in a world where almost everyone has superpowers, this anime follows the journey of Izuku Midoriya, a young boy born without powers, as he trains to become a hero.\n\n4. One Punch Man (2015-): This comedy-action series follows Saitama, a hero who can defeat any opponent with a single punch, and his adventures with his disciple, Genos.\n\n5. Death Note (2013): A psychological thriller about a high school student who discovers a notebook that allows him to kill anyone whose name he writes in it, leading to a cat-and-mouse game with a genius detective.\n\n6. Your Lie in April (2014): A touching story about a piano prodigy who loses his ability to hear and a violinist who helps him rediscover his passion for music.\n\n7. Tokyo Ghoul (2014-2018): This dark fantasy series follows Kaneki Ken, a college student who becomes a half-ghoul after a traumatic incident, and his struggle to survive in a world where humans and ghouls are at odds.\n\n8. Fate/Zero (2011-2012): A prequel to the Fate/Stay Night series, this anime follows seven mages and their summoned heroic spirits as they fight to obtain the Holy Grail, a magical device that can grant any wish.\n\n9. Hunter x Hunter (2011-2014): Gon Freecss's journey to find his father and become a Hunter, an exceptional being capable of greatness, is filled with thrilling adventures and intense battles.\n\n10.JoJo's Bizarre Adventure: Diamond is Unbreakable(2016-2017): The latest arc in the long-running JoJo's Bizarre Adventure series follows Josuke Higashikata as he battles Stand users in his hometown",
      "author": "Nime",
      "tags": [
        "anime"
      ],
      "date": "2024-10-30T20:43:46.381Z"
    },
    {
      "id": "68be",
      "title": "Top 10 Football Players of This Decade",
      "content": "Cristiano Ronaldo: Ronaldo's athleticism, competitive spirit, and goal-scoring prowess have made him one of the most iconic players of this decade, playing for clubs like Real Madrid, Juventus, and Manchester United. His consistency, leadership, and ability to perform under pressure make him a legend in football history.\n\nLionel Messi: Known for his incredible dribbling skills and goal-scoring ability, Messi has continued to dominate the football world with his performances for Barcelona and now Paris Saint-Germain. His vision and creativity on the field are unmatched.\n\nKylian Mbappé: A rising star, Mbappé has impressed with his speed and agility, becoming a key player for Paris Saint-Germain and the French national team. His potential seems limitless.\n\nKevin De Bruyne: Known for his playmaking abilities, De Bruyne has been instrumental in Manchester City's success, contributing to their multiple Premier League titles. His precise passes and vision make him a joy to watch.\n\nNeymar Jr.: Neymar's flair, skill, and goal-scoring ability have made him one of the most exciting players to watch, playing for Barcelona, Paris Saint-Germain, and the Brazilian national team. He's a magician with the ball at his feet.\n\nRobert Lewandowski: A prolific striker, Lewandowski has consistently scored goals for Bayern Munich and Poland, earning him numerous individual awards. His clinical finishing is second to none.\n\nLuis Suárez: Known for his versatility and technical skills, Suárez has been a key player for Liverpool, Barcelona, and the Uruguayan national team. His tenacity and goal-scoring ability are remarkable.\n\nSadio Mané: Mané's speed, skill, and goal-scoring ability have made him a standout player for Liverpool and Senegal. His work ethic and humble personality add to his appeal.\n\nMohamed Salah: Salah's incredible speed and goal-scoring record have made him one of the top players in the Premier League, playing for Liverpool and Egypt. His journey to stardom is inspiring.\n\nAndres Iniesta: A masterful midfielder, Iniesta has been a key player for Barcelona and Spain, known for his vision, passing, and playmaking abilities. His calmness under pressure is legendary.",
      "author": "Football Blogger",
      "tags": [
        "football"
      ],
      "date": "2024-10-30T20:46:09.153Z"
    },
    {
      "id": "5fc6",
      "title": "Top 10 Tech Gadgets of This Decade",
      "content": "iPhone: The iPhone revolutionized the smartphone industry with its sleek design, intuitive interface, and innovative features. Each new model brought advancements in technology, making it a must-have device for millions.\n\nAmazon Echo: The Echo and its voice assistant, Alexa, brought smart home technology into the mainstream. With its ability to control smart devices, play music, and provide information, it has become a staple in many households.\n\nApple Watch: The Apple Watch combined fitness tracking, health monitoring, and smart notifications in a stylish wearable device. It has become an essential accessory for many, helping users stay connected and healthy.\n\nTesla Model S: This electric car redefined the automotive industry with its impressive range, performance, and innovative features like autopilot. It paved the way for the future of electric vehicles.\n\nRaspberry Pi: This affordable, credit-card-sized computer has empowered hobbyists, educators, and professionals to create a wide range of projects, from home automation to robotics.\n\nNintendo Switch: The Switch's hybrid design, allowing it to be used as both a handheld and home console, along with its strong library of games, made it a hit among gamers of all ages.\n\nGoogle Home: Similar to the Amazon Echo, Google Home brought voice control to smart homes with Google Assistant. It offers seamless integration with other Google services and smart devices.\n\nSony A7R II: This full-frame mirrorless camera set a new standard for image quality and versatility, making it a favorite among photographers and videographers.\n\nAirPods: Apple's wireless earbuds became a cultural phenomenon, known for their sound quality, ease of use, and seamless integration with Apple devices.\n\nSamsung Galaxy Note: The Galaxy Note series popularized the phablet form factor, combining the portability of a smartphone with the productivity of a tablet, thanks to its large screen and stylus.",
      "author": "Techyboyy",
      "tags": [
        "tech"
      ],
      "date": "2024-10-30T20:46:54.779Z"
    }
  ]
}